package ex09;

import java.util.Arrays;

/*
 * 버블정렬...
 * 
 * 정보처리기사.. 필기...
 * 버블정렬을 했을때에 다음에 보기에서 2회전 했을때 맞는 것은?
 * 1) 90,60,40,100,120 2) { 60,40,90,100,120}
 * 
 * 코드리뷰..
 * 1회전
 * { 100,90,60,40,120}
 * { 90,100,60,40,120}
 * { 90,60,100,40,120}
 * { 90,60,40,100,120}
 * 2회전
 * { 60,90,40,100,120}
 * { 60,40,90,100,120}
 * 3회전
 * { 40,60,90,100,120}

 * 내림차순
 * 120 100 90 60 40
 * 오름차순
 * 40 60 90 100 120

 * 1. 요소중 제일 큰수
 * 2. 요소중 제일 작은수
 * 
 * 3. 내림차순
 * 4. 오름차순
 */
public class Ex04 {

	public static void main(String[] args) {

		// ai af
		// 선입선출

		int[] arr = { 100, 90, 60, 40, 120 };

		for (int i = 0; i < 5 - i; i++) {
			for (int j = 0; j < 5 - j; j++) {
				if (arr[j] > arr[j + 1]) {
					int temp = arr[j];
					arr[j] = arr[j + 1];
					arr[j + 1] = temp;
				}
			}
		}

		System.out.println(Arrays.toString(arr));
	}

}
